In [198]:
import pandas as pd
import numpy as np
import re
import datetime
from nltk.corpus import stopwords
from sklearn.preprocessing import LabelEncoder
from nltk.stem.snowball import SnowballStemmer
from sklearn.feature_extraction.text import CountVectorizer
import xgboost as xgb

pd.set_option('display.max_colwidth',100)

In [199]:
data = pd.read_csv("../Downloads/ship_data.csv")
data.head(10)

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived
0,1,3,Alexander Harris,male,22.0,1,0,7250.0,New York,0
1,2,1,Frank Parsons,female,38.0,1,0,71283.3,Los Angeles,1
2,3,3,Anthony Churchill,female,26.0,0,0,7925.0,New York,1
3,4,1,Alexandra Hughes,female,35.0,1,0,53100.0,New York,1
4,5,3,Joan Fraser,male,35.0,0,0,8050.0,New York,0
5,6,3,Megan Clarkson,male,NaN,0,0,8458.3,Chicago,0
6,7,1,Molly Bower,male,54.0,0,0,51862.5,New York,0
7,8,3,Steven Jones,male,2.0,3,1,21075.0,New York,0
8,9,3,Bernadette Vance,female,27.0,0,2,11133.3,New York,1
9,10,2,Irene Chapman,female,-20.0,1,0,30070.8,Los Angeles,1

In [200]:
data['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [201]:
data['Class'].value_counts()

3    491
1    216
2    184
Name: Class, dtype: int64

In [202]:
child = data['Age'] < 16.0
valid_age = data['Age'] > 0.0

In [203]:
children = data[child & valid_age]
children

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived
7,8,3,Steven Jones,male,2.00,3,1,21075.0,New York,0
10,11,3,Gavin Payne,female,4.00,1,1,16700.0,New York,1
14,15,3,Evan Mackay,female,14.00,0,0,7854.2,New York,0
16,17,3,Sonia Knox,male,2.00,4,1,29125.0,Chicago,0
22,23,3,James Russell,female,15.00,0,0,8029.2,Chicago,1
24,25,3,Blake Harris,female,8.00,3,1,21075.0,New York,0
39,40,3,Rose Mathis,female,14.00,1,0,11241.7,Los Angeles,1
43,44,2,Jack Gray,female,3.00,1,2,41579.2,Los Angeles,1
50,51,3,Trevor Fisher,male,7.00,4,1,39687.5,New York,0
58,59,2,Peter Oliver,female,5.00,1,2,27750.0,New York,1
59,60,3,Michelle Slater,male,11.00,5,2,46900.0,New York,0
63,64,3,Sarah Watson,male,4.00,3,2,27900.0,New York,0
78,79,2,Joanne Sutherland,male,0.83,0,2,29000.0,New York,1
111,112,3,Nathan Parr,female,14.50,1,0,14454.2,Los Angeles,0
119,120,3,Jack Powell,female,2.00,4,2,31275.0,New York,0
125,126,3,Hannah Smith,male,12.00,1,0,11241.7,Los Angeles,1
147,148,3,Nathan Gibson,female,9.00,2,2,34375.0,New York,0
164,165,3,Wanda Gill,male,1.00,4,1,39687.5,New York,0
165,166,3,Rose Mitchell,male,9.00,0,2,20525.0,New York,1
171,172,3,Piers Russell,male,4.00,4,1,29125.0,Chicago,0
172,173,3,Megan Fraser,female,1.00,1,1,11133.3,New York,1
182,183,3,Irene Terry,male,9.00,4,2,31387.5,New York,0
183,184,2,Joshua Lawrence,male,1.00,2,1,39000.0,New York,1
184,185,3,Julian McLean,female,4.00,0,2,22025.0,New York,1
193,194,2,Dorothy Murray,male,3.00,1,1,26000.0,New York,1
205,206,3,Richard Martin,female,2.00,0,1,10462.5,New York,0
233,234,3,Sean Campbell,female,5.00,4,2,31387.5,New York,1
237,238,2,Diana Hughes,female,8.00,0,2,26250.0,New York,1
261,262,3,Warren Springer,male,3.00,4,2,31387.5,New York,1
278,279,3,Dan Davidson,male,7.00,4,1,29125.0,Chicago,0
...,...,...,...,...,...,...,...,...,...,...
549,550,2,Dominic Hill,male,8.00,1,1,36750.0,New York,1
618,619,2,Blake Roberts,female,4.00,2,1,39000.0,New York,1
634,635,3,Jessica Bell,female,9.00,3,2,27900.0,New York,0
642,643,3,Matt Howard,female,2.00,3,2,27900.0,New York,0
644,645,3,Claire MacLeod,female,0.75,2,1,19258.3,Los Angeles,1
683,684,3,Tim Robertson,male,14.00,5,2,46900.0,New York,0
686,687,3,Faith King,male,14.00,4,1,39687.5,New York,0
689,690,1,Jake Thomson,female,15.00,0,1,211337.5,New York,1
691,692,3,Brandon Morgan,female,4.00,0,1,13416.7,Los Angeles,1
720,721,2,Victor Turner,female,6.00,0,1,33000.0,New York,1
731,732,3,Christopher White,male,11.00,0,0,18787.5,Los Angeles,0
750,751,2,Pippa Smith,female,4.00,1,1,23000.0,New York,1
751,752,3,Virginia Marshall,male,6.00,0,1,12475.0,New York,1
755,756,2,Madeleine Skinner,male,0.67,1,1,14500.0,New York,1
777,778,3,Owen MacDonald,female,5.00,0,0,12475.0,New York,1
780,781,3,Alison May,female,13.00,0,0,7229.2,Los Angeles,1
787,788,3,Blake Parsons,male,8.00,4,1,29125.0,Chicago,0
788,789,3,Keith MacLeod,male,1.00,1,2,20575.0,New York,1
802,803,1,Ryan Rampling,male,11.00,1,2,120000.0,New York,1
803,804,3,Stewart Roberts,male,0.42,0,1,8516.7,Los Angeles,1
813,814,3,Anna Wright,female,6.00,4,2,31275.0,New York,0
819,820,3,Andrew North,male,10.00,3,2,27900.0,New York,0
824,825,3,Zoe Payne,male,2.00,4,1,39687.5,New York,0
827,828,2,Deirdre Henderson,male,1.00,0,2,37004.2,Los Angeles,1
830,831,3,Penelope Murray,female,15.00,1,0,14454.2,Los Angeles,1
831,832,2,Lisa Quinn,male,0.83,1,1,18750.0,New York,1
850,851,3,Nicholas Vance,male,4.00,4,2,31275.0,New York,0
852,853,3,Victor Paterson,female,9.00,1,1,15245.8,Los Angeles,0
869,870,3,Chloe Hunter,male,4.00,1,1,11133.3,New York,1
875,876,3,Rose Mackenzie,female,15.00,0,0,7225.0,Los Angeles,1

In [204]:
children.shape

(82, 10)

In [205]:
children['Class'].value_counts()

3    58
2    18
1     6
Name: Class, dtype: int64

In [206]:
data.isnull().any()

Passenger ID      False
Class             False
Name              False
Gender            False
Age                True
Siblings Count    False
Parents Count     False
Fare              False
Embarked           True
Survived          False
dtype: bool

In [207]:
data['Age'] = data['Age'].fillna(data['Age'].mean())

In [218]:
data['Embarked'] = data['Embarked'].fillna("New York")

In [220]:
data['Embarked'].value_counts()

New York       646
Los Angeles    168
Chicago         77
Name: Embarked, dtype: int64

In [222]:
data.isnull().any()

Passenger ID      False
Class             False
Name              False
Gender            False
Age               False
Siblings Count    False
Parents Count     False
Fare              False
Embarked          False
Survived          False
dtype: bool

In [223]:
data.head()

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived
0,1,3,Alexander Harris,male,22.0,1,0,7250.0,New York,0
1,2,1,Frank Parsons,female,38.0,1,0,71283.3,Los Angeles,1
2,3,3,Anthony Churchill,female,26.0,0,0,7925.0,New York,1
3,4,1,Alexandra Hughes,female,35.0,1,0,53100.0,New York,1
4,5,3,Joan Fraser,male,35.0,0,0,8050.0,New York,0

In [224]:
data['Family'] = data['Siblings Count'] + data['Parents Count']

In [225]:
data.head()

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived,Family
0,1,3,Alexander Harris,male,22.0,1,0,7250.0,New York,0,1
1,2,1,Frank Parsons,female,38.0,1,0,71283.3,Los Angeles,1,1
2,3,3,Anthony Churchill,female,26.0,0,0,7925.0,New York,1,0
3,4,1,Alexandra Hughes,female,35.0,1,0,53100.0,New York,1,1
4,5,3,Joan Fraser,male,35.0,0,0,8050.0,New York,0,0

In [226]:
alone = data[data['Family'] == 0]
with_family = data[data['Family'] != 0]

In [227]:
print "alone count:",alone.shape[0]
print "with family count:",with_family.shape[0]

alone count: 537
with family count: 354

In [228]:
data.groupby(data['Class']).Survived.value_counts(normalize = True)

Class  Survived
1      1           0.629630
       0           0.370370
2      0           0.527174
       1           0.472826
3      0           0.757637
       1           0.242363
Name: Survived, dtype: float64

In [229]:
data.groupby(data['Gender']).Survived.value_counts(normalize = True)

Gender  Survived
female  1           0.742038
        0           0.257962
male    0           0.811092
        1           0.188908
Name: Survived, dtype: float64

In [230]:
data['has_family'] = data['Family']&1
data

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived,Family,has_family
0,1,3,Alexander Harris,male,22.000000,1,0,7250.0,New York,0,1,1
1,2,1,Frank Parsons,female,38.000000,1,0,71283.3,Los Angeles,1,1,1
2,3,3,Anthony Churchill,female,26.000000,0,0,7925.0,New York,1,0,0
3,4,1,Alexandra Hughes,female,35.000000,1,0,53100.0,New York,1,1,1
4,5,3,Joan Fraser,male,35.000000,0,0,8050.0,New York,0,0,0
5,6,3,Megan Clarkson,male,30.014244,0,0,8458.3,Chicago,0,0,0
6,7,1,Molly Bower,male,54.000000,0,0,51862.5,New York,0,0,0
7,8,3,Steven Jones,male,2.000000,3,1,21075.0,New York,0,4,0
8,9,3,Bernadette Vance,female,27.000000,0,2,11133.3,New York,1,2,0
9,10,2,Irene Chapman,female,-20.000000,1,0,30070.8,Los Angeles,1,1,1
10,11,3,Gavin Payne,female,4.000000,1,1,16700.0,New York,1,2,0
11,12,1,Melanie Scott,female,58.000000,0,0,26550.0,New York,1,0,0
12,13,3,Vanessa MacDonald,male,20.000000,0,0,8050.0,New York,0,0,0
13,14,3,Pippa Gray,male,39.000000,1,5,31275.0,New York,0,6,0
14,15,3,Evan Mackay,female,14.000000,0,0,7854.2,New York,0,0,0
15,16,2,Jack Bell,female,55.000000,0,0,16000.0,New York,1,0,0
16,17,3,Sonia Knox,male,2.000000,4,1,29125.0,Chicago,0,5,1
17,18,2,Adam Vance,male,30.014244,0,0,13000.0,New York,1,0,0
18,19,3,Piers Buckland,female,31.000000,1,0,18000.0,New York,0,1,1
19,20,3,Brian Jackson,female,30.014244,0,0,7225.0,Los Angeles,1,0,0
20,21,2,Emily Campbell,male,35.000000,0,0,26000.0,New York,0,0,0
21,22,2,Ian Mitchell,male,34.000000,0,0,13000.0,New York,1,0,0
22,23,3,James Russell,female,15.000000,0,0,8029.2,Chicago,1,0,0
23,24,1,Maria Mitchell,male,-5.000000,0,0,35500.0,New York,1,0,0
24,25,3,Blake Harris,female,8.000000,3,1,21075.0,New York,0,4,0
25,26,3,Adam Ball,female,38.000000,1,5,31387.5,New York,1,6,0
26,27,3,Boris Walsh,male,30.014244,0,0,7225.0,Los Angeles,0,0,0
27,28,1,Steven Butler,male,19.000000,3,2,263000.0,New York,0,5,1
28,29,3,Gabrielle Sutherland,female,30.014244,0,0,7879.2,Chicago,1,0,0
29,30,3,Angela Gibson,male,30.014244,0,0,7895.8,New York,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
861,862,2,Jason Nolan,male,21.000000,1,0,11500.0,New York,0,1,1
862,863,1,William Cameron,female,48.000000,0,0,25929.2,New York,1,0,0
863,864,3,Gabrielle Carr,female,30.014244,8,2,69550.0,New York,0,10,0
864,865,2,Paul Lyman,male,24.000000,0,0,13000.0,New York,0,0,0
865,866,2,Ryan Roberts,female,42.000000,0,0,13000.0,New York,1,0,0
866,867,2,Pippa Payne,female,27.000000,1,0,13858.3,Los Angeles,1,1,1
867,868,1,Leah Ince,male,31.000000,0,0,50495.8,New York,0,0,0
868,869,3,Victor Buckland,male,30.014244,0,0,9500.0,New York,0,0,0
869,870,3,Chloe Hunter,male,4.000000,1,1,11133.3,New York,1,2,0
870,871,3,Megan Greene,male,26.000000,0,0,7895.8,New York,0,0,0
871,872,1,Heather Ellison,female,47.000000,1,1,52554.2,New York,1,2,0
872,873,1,John Lee,male,33.000000,0,0,5000.0,New York,0,0,0
873,874,3,Alexander Hughes,male,47.000000,0,0,9000.0,New York,0,0,0
874,875,2,Sally Morgan,female,28.000000,1,0,24000.0,Los Angeles,1,1,1
875,876,3,Rose Mackenzie,female,15.000000,0,0,7225.0,Los Angeles,1,0,0
876,877,3,Isaac Roberts,male,20.000000,0,0,9845.8,New York,0,0,0
877,878,3,Audrey Fisher,male,19.000000,0,0,7895.8,New York,0,0,0
878,879,3,David Allan,male,30.014244,0,0,7895.8,New York,0,0,0
879,880,1,Victor Springer,female,56.000000,0,1,83158.3,Los Angeles,1,1,1
880,881,2,Alison Oliver,female,25.000000,0,1,26000.0,New York,1,1,1
881,882,3,William Walker,male,33.000000,0,0,7895.8,New York,0,0,0
882,883,3,Dorothy Rampling,female,22.000000,0,0,10516.7,New York,0,0,0
883,884,2,Max Poole,male,28.000000,0,0,10500.0,New York,0,0,0
884,885,3,Simon Rutherford,male,25.000000,0,0,7050.0,New York,0,0,0
885,886,3,Diane Simpson,female,39.000000,0,5,29125.0,Chicago,0,5,1
886,887,2,Bella Tucker,male,27.000000,0,0,13000.0,New York,0,0,0
887,888,1,Boris Howard,female,19.000000,0,0,30000.0,New York,1,0,0
888,889,3,Cameron Lambert,female,30.014244,1,2,23450.0,New York,0,3,1
889,890,1,Theresa Hill,male,26.000000,0,0,30000.0,Los Angeles,1,0,0
890,891,3,Caroline Fraser,male,32.000000,0,0,7750.0,Chicago,0,0,0

In [231]:
data.groupby(data['has_family']).Survived.value_counts(normalize = True)

has_family  Survived
0           0           0.659733
            1           0.340267
1           1           0.518349
            0           0.481651
Name: Survived, dtype: float64

In [232]:
"If a person had family survival chance is 48%, whereas if he doesn't have any family 34%"

"If a person had family survival chance is 48%, whereas if he doesn't have any family 34%"

# 10 th part starts here

In [233]:
data.head()

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived,Family,has_family
0,1,3,Alexander Harris,male,22.0,1,0,7250.0,New York,0,1,1
1,2,1,Frank Parsons,female,38.0,1,0,71283.3,Los Angeles,1,1,1
2,3,3,Anthony Churchill,female,26.0,0,0,7925.0,New York,1,0,0
3,4,1,Alexandra Hughes,female,35.0,1,0,53100.0,New York,1,1,1
4,5,3,Joan Fraser,male,35.0,0,0,8050.0,New York,0,0,0

In [234]:
data.dtypes

Passenger ID        int64
Class               int64
Name               object
Gender             object
Age               float64
Siblings Count      int64
Parents Count       int64
Fare              float64
Embarked           object
Survived            int64
Family              int64
has_family          int64
dtype: object

In [261]:
data['Gender'].value_counts()

0    577
1    314
Name: Gender, dtype: int64

In [238]:
data.loc[data.Gender == 'male','Gender'] = 0
data.loc[data.Gender == 'female','Gender'] = 1

In [262]:
data['Embarked'].value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

In [239]:
data.loc[data.Embarked == 'New York','Embarked'] = 0
data.loc[data.Embarked == 'Los Angeles','Embarked'] = 1
data.loc[data.Embarked == 'Chicago','Embarked'] = 2

In [240]:
data.head()

,Passenger ID,Class,Name,Gender,Age,Siblings Count,Parents Count,Fare,Embarked,Survived,Family,has_family
0,1,3,Alexander Harris,0,22.0,1,0,7250.0,0,0,1,1
1,2,1,Frank Parsons,1,38.0,1,0,71283.3,1,1,1,1
2,3,3,Anthony Churchill,1,26.0,0,0,7925.0,0,1,0,0
3,4,1,Alexandra Hughes,1,35.0,1,0,53100.0,0,1,1,1
4,5,3,Joan Fraser,0,35.0,0,0,8050.0,0,0,0,0

In [241]:
data.isnull().any()

Passenger ID      False
Class             False
Name              False
Gender            False
Age               False
Siblings Count    False
Parents Count     False
Fare              False
Embarked          False
Survived          False
Family            False
has_family        False
dtype: bool

In [242]:
data.dtypes

Passenger ID        int64
Class               int64
Name               object
Gender             object
Age               float64
Siblings Count      int64
Parents Count       int64
Fare              float64
Embarked           object
Survived            int64
Family              int64
has_family          int64
dtype: object

In [253]:
data['Gender'] = data['Gender'].convert_objects(convert_numeric=True)
data['Embarked'] = data['Embarked'].convert_objects(convert_numeric=True)

/home/sanju/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  if __name__ == '__main__':
/home/sanju/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  from ipykernel import kernelapp as app

In [255]:
features = ['Class','Age','Family','Fare','Embarked','Gender']
target = ['Survived']

In [263]:
from sklearn.model_selection import train_test_split

In [257]:
Xtrain,Xtest=train_test_split(data,test_size=0.10)

In [265]:
from xgboost import XGBClassifier
model = XGBClassifier()
final_model = XGBClassifier()

In [266]:
model.fit(Xtrain[features],Xtrain[target])

XGBClassifier(base_score=0.5, colsample_bylevel=1, colsample_bytree=1,
       gamma=0, learning_rate=0.1, max_delta_step=0, max_depth=3,
       min_child_weight=1, missing=None, n_estimators=100, nthread=-1,
       objective='binary:logistic', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=True, subsample=1)

In [267]:
print(model.score(Xtest[features],Xtest[target]))

0.833333333333

In [268]:
# training on the whole training data
final_model.fit(data[features],data[target])

XGBClassifier(base_score=0.5, colsample_bylevel=1, colsample_bytree=1,
       gamma=0, learning_rate=0.1, max_delta_step=0, max_depth=3,
       min_child_weight=1, missing=None, n_estimators=100, nthread=-1,
       objective='binary:logistic', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=True, subsample=1)